# Search for apps names here: https://brew.sh/

# Brew
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "hashicorp/tap"

## Development
cask "iterm2"
cask "webstorm"
cask "visual-studio-code"
cask "dbeaver-community"
brew 'pre-commit'

## Platforms
brew "java"
brew "nvm"
cask "docker"
# cask "google-cloud-sdk"

## Messengers
cask "telegram"
cask "whatsapp"
cask "skype"
cask "slack"
cask "zoom"

## Content
cask "google-drive"
# cask "qbittorrent"
cask "transmission"
# cask "the-unarchiver"
cask "google-chrome"
cask "microsoft-edge"
cask "opera"
cask "firefox"
cask "vlc"
cask "handbrake"
cask "sublime-text"
cask "steam"

## Utilities
cask "spectacle"
cask "upwork"

# Not supported by M1 architecture
# cask "virtualbox"

## Need password
cask "microsoft-teams"
