# Search for apps names here: https://brew.sh/

# Brew
tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "homebrew/core"
tap "homebrew/services"
tap "hashicorp/tap"

## Platforms
brew "k6"
brew "java"
brew "python@3.10"
brew "nvm"
cask "docker"
# cask "google-cloud-sdk"

## Development
cask "iterm2"
cask "webstorm"
cask "visual-studio-code"
cask "dbeaver-community"
brew "pre-commit"
cask "ngrok"

## Messengers
cask "telegram"
cask "whatsapp"
cask "skype"
cask "slack"
cask "zoom"

## Content
cask "google-drive"
cask "qbittorrent"
# cask "transmission"
# cask "the-unarchiver"
cask "vlc"
cask "handbrake"
cask "sublime-text"
cask "todoist"
cask "steam"

## Browser
cask "google-chrome"
cask "microsoft-edge"
cask "opera"
cask "firefox"
cask "tor-browser"
cask "brave-browser"
cask "eloston-chromium"
cask "yandex"

## Utilities
# cask "vmware-fusion"
cask "spectacle"
cask "teamviewer"
cask "upwork"
# cask "windscribe"

# Not supported by M1 architecture
# cask "virtualbox"

## Need password
cask "microsoft-teams"

cask "android-file-transfer"
# cask "ipfs"
